In [41]:
import pandas as pd

In [7]:
list=[1,2,3,4,5,6]
print(list)

[1, 2, 3, 4, 5, 6]

In [8]:
series=pd.Series(list)
print(series)

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [15]:
empty=pd.Series([])
empty

Series([], dtype: object)

In [50]:
a=pd.Series([1,2,3,4,5,6],[5,6,7,8,9,10])
a

5     1
6     2
7     3
8     4
9     5
10    6
dtype: int64

In [5]:
dict_series=pd.Series({'a':1,'b':2,'c':3})
dict_series

a    1
b    2
c    3
dtype: int64

In [6]:
dict_series[0]

C:\Users\singh\AppData\Local\Temp\ipykernel_16796\1198263229.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  dict_series[0]

1

In [ ]:
# csv files

In [54]:
l1=[1,2,3,4,5,6]
df=pd.DataFrame(l1)
df

   0
0  1
1  2
2  3
3  4
4  5
5  6

In [60]:
a=({'a':1,'b':2,'c':3,'d':4},{'a':5,'b':6,'c':7,'d':8})
df=pd.DataFrame(a)
df

   a  b  c  d
0  1  2  3  4
1  5  6  7  8

In [61]:
b={'name':pd.Series(['a','b','c','d']),'rollno.':pd.Series([1,2,3,4])}
df=pd.DataFrame(b)
df

  name  rollno.
0    a        1
1    b        2
2    c        3
3    d        4

In [3]:
df=pd.read_csv(r'C:\Users\singh\OneDrive\Documents\Orders.csv')
df

    Order ID  Order Date CustomerName             State     City
0    B-26055  10-03-2018    Harivansh     Uttar Pradesh  Mathura
1    B-25993  03-02-2018       Madhav             Delhi    Delhi
2    B-25973  24-01-2018  Madan Mohan     Uttar Pradesh  Mathura
3    B-25923  27-12-2018        Gopal       Maharashtra   Mumbai
4    B-25757  21-08-2018     Vishakha    Madhya Pradesh   Indore
..       ...         ...          ...               ...      ...
495  B-25742  03-08-2018       Ashwin               Goa      Goa
496  B-26088  26-03-2018       Bhavna            Sikkim  Gangtok
497  B-25707  01-07-2018      Shivani       Maharashtra   Mumbai
498  B-25758  22-08-2018      Shubham  Himachal Pradesh    Simla
499  B-26095  28-03-2018      Monisha         Rajasthan   Jaipur

[500 rows x 5 columns]

In [70]:
df.columns

Index(['Order ID', 'Order Date', 'CustomerName', 'State', 'City'], dtype='object')

In [71]:
df.shape

(500, 5)

In [72]:
df.size

2500

In [73]:
df.head()

  Order ID  Order Date CustomerName           State     City
0  B-26055  10-03-2018    Harivansh   Uttar Pradesh  Mathura
1  B-25993  03-02-2018       Madhav           Delhi    Delhi
2  B-25973  24-01-2018  Madan Mohan   Uttar Pradesh  Mathura
3  B-25923  27-12-2018        Gopal     Maharashtra   Mumbai
4  B-25757  21-08-2018     Vishakha  Madhya Pradesh   Indore

In [77]:
df.tail()

    Order ID  Order Date CustomerName             State     City
495  B-25742  03-08-2018       Ashwin               Goa      Goa
496  B-26088  26-03-2018       Bhavna            Sikkim  Gangtok
497  B-25707  01-07-2018      Shivani       Maharashtra   Mumbai
498  B-25758  22-08-2018      Shubham  Himachal Pradesh    Simla
499  B-26095  28-03-2018      Monisha         Rajasthan   Jaipur

In [78]:
df.describe()

       Order ID  Order Date CustomerName        State    City
count       500         500          500          500     500
unique      500         307          336           19      25
top     B-26055  24-11-2018       Shreya  Maharashtra  Indore
freq          1           7            6           94      71

In [80]:
df.isnull()

     Order ID  Order Date  CustomerName  State   City
0       False       False         False  False  False
1       False       False         False  False  False
2       False       False         False  False  False
3       False       False         False  False  False
4       False       False         False  False  False
..        ...         ...           ...    ...    ...
495     False       False         False  False  False
496     False       False         False  False  False
497     False       False         False  False  False
498     False       False         False  False  False
499     False       False         False  False  False

[500 rows x 5 columns]

In [126]:
df.isnull().sum().sum()

0

In [4]:
df.shape

(500, 5)

In [12]:
df1=pd.DataFrame({'roll no.':[1,2,3,4,5],'physics':[12,34,56,78,90]})
df1

   roll no.  physics
0         1       12
1         2       34
2         3       56
3         4       78
4         5       90

In [43]:
df2=pd.DataFrame({'roll no.':[1,2,3,4,5],'chemistry':[34,23,45,76,87]})
df2

   roll no.  chemistry
0         1         34
1         2         23
2         3         45
3         4         76
4         5         87

In [46]:
pd.merge(df1,df2, on='roll no.')

KeyError: 'roll no.'

In [51]:
# First DataFrame
df5 = pd.DataFrame({
    'DeliveryID': [1, 2],
    'Region': ['North', 'East'],
    'DelayHours': [0.2, 1.1]
})
print(df5)

   DeliveryID Region  DelayHours
0           1  North         0.2
1           2   East         1.1

In [ ]:
# Second DataFrame
df7 = pd.DataFrame({
    'DeliveryID': [3, 4],
    'Region': ['South', 'West'],
    'DelayHours': [2.5, 0.7]
})
print(df7)

   DeliveryID Region  DelayHours
0           3  South         2.5
1           4   West         0.7